<!-- ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| -->
<!-- ===========================================================Проверка отправки почты====================================================================== -->
<!-- ||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||| -->
<?php 
$to = "zemtsov_dmitriy1@mail.ru"; // Тут указываем свою почту
$subject = "e-mail тест"; // Тема письма
// Сообщение
$message = "Это тестовое сообщение.\n
Если ты можешь его прочитать, значит все ОК?\n
Конец сообщения.";
// Перенос строк
$message = wordwrap($message, 70);
// возратит TRUE, если письмо успешно передано
// почтовой программе например exim
if (mail($to, $subject, $message)) {
	echo("Почта была отправлена … вроде бы");
} else { 
	echo("Увы, но почта не отправлена!");
}

?>