\\===================Ссылка в меню срабатывает со 2 раза =====================

	1)Добавить ссылкам data - count;
2)При клике получать атрибут у e.target.dataset.count;
3)Проверка if (e.target.dataset.count <= 1) {
	e.preventDefault()
};



/*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
===================================================Отправка формы POST через ajax (jquery)=======================================
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*/

// получаем урл этй же страницы
let thisURL = `https://integrate.chameleon-games.ru${window.location.pathname}`;

// ===========получаем форму или инпут================
$(".table__header-search").on("input", function (event) {
	event.prevaentDefault();
	// получаем параметры для передачи
	let name = $(this).attr("name");
	let value = $(this).val();
	sendData = {
		[name]: value
	};
	// передаем через ajax
	$.ajax({
		url: `${thisURL}`,
		method: 'post',
		dataType: 'html',
		data: sendData,
		success: function () {
			console.log('ajax search- ok');
		}
	});
});


/*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
===================================================Получить php массив в js=======================================
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*/

<script>
	const arResult = <?= json_encode($arListCompare); ?>;
</script>


/*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
===================================================Подключение яндекс карты по бесплатному api=======================================
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*/

// ------------- cdn подключение ------------------
<script src="https://api-maps.yandex.ru/2.0-stable/?load=package.standard&lang=ru-RU"></script>

// ------------- html оболочка для карты ------------------
<div id="map" style="width: 100%; height: 400px"></div>

// ------------- инициализация карты ------------------
<script>
	ymaps.ready(init);
	var myMap,
		myPlacemark;

	function init() {
		// ---Создает карту------
		myMap = new ymaps.Map("map", {
			center: [55.646569, 37.670339],
			zoom: 16,
		});

		// ---регистрация метки------- 
		myPlacemark = new ymaps.Placemark([55.646569, 37.670339], { hintContent: "ООО «Услуги для бизнеса»", balloonContent: "ООО «Услуги для бизнеса»" });

		// ---Добавление метки на карту------- 
		myMap.geoObjects.add(myPlacemark);
	}

</script>