<!-- ====================добавляет возможность редактировать каждый элемент из публичной части============================================ -->

<?
$this->AddEditAction($arItem['ID'], $arItem['EDIT_LINK'], CIBlock::GetArrayByID($arItem["IBLOCK_ID"], "ELEMENT_EDIT"));
$this->AddDeleteAction($arItem['ID'], $arItem['DELETE_LINK'], CIBlock::GetArrayByID($arItem["IBLOCK_ID"], "ELEMENT_DELETE"), array("CONFIRM" => GetMessage('CT_BNL_ELEMENT_DELETE_CONFIRM')));
?>

id="
<?= $this->GetEditAreaId($arItem['ID']); ?>"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
<!-- ==============================================Получить родительский раздел по id============================================== -->
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

$arSec = CIBlockSection::GetByID($arParams["PARENT_SECTION"]);
$arEl = $arSec->getNext();


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
<!-- ==================Метод возвращает путь от корня сайта к зарегистрированному файлу. Возвращает NULL, если файл не зарегистрирован. Статический метод.=================================================== -->
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

CFile::GetPath(
int file_id
)


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
<!-- ===================================добавляет возможность редактировать раздел из публичной части=============================== -->
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

$arButtons = CIBlock::GetPanelButtons(
$arParams["IBLOCK_ID"],
false,
$arParams["PARENT_SECTION"],
);

$editLink = $arButtons["edit"]["edit_section"]["ACTION_URL"];
$deleteLink = $arButtons["edit"]["delete_section"]["ACTION_URL"];

$this->AddEditAction($arParams["PARENT_SECTION"], $editLink, CIBlock::GetArrayByID($arParams["IBLOCK_ID"], "ELEMENT_EDIT"));
$this->AddDeleteAction($arParams["PARENT_SECTION"], $deleteLink, CIBlock::GetArrayByID($arParams["IBLOCK_ID"], "ELEMENT_DELETE"), array("CONFIRM" => GetMessage('CT_BNL_ELEMENT_DELETE_CONFIRM')));

id="<?= $this->GetEditAreaId($arParams["PARENT_SECTION"]); ?>"


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
<!-- ================================получить св-ва элементов===================================================== -->
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

<?
$property_enums = CIBlockPropertyEnum::GetList([], ['IBLOCK_ID' => $arResult["ID"]]);
while ($enum_fields = $property_enums->GetNext()) {
    echo '<span class="tabs__title" data-filter="' . $enum_fields[" ID"] . '">' . $enum_fields["VALUE"] . '</span>';
} ?>

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
<!--===========================изменение формата вывода времени==========================================-->
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

<?= CIBlockFormatProperties::DateFormat("d F", MakeTimeStamp($arItem['DISPLAY_ACTIVE_FROM'], CSite::GetDateFormat())) ?>


//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
<!--===========================Фильтр==========================================-->
\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\
<!-- js -->
function getFilter() {
let filterItem = $(".tabs__title");
filterItem.each(function () {
$(this).on("click", function () {
let filterId = $(this).attr('data-filter');
$.ajax({
url: location.pathname,
type: "post",
data: {
"_ajax": "Y",
"filialId": filterId,
},
// dataType: 'json',
success: function (result) {
$('body').find('.tabs__item-content-box').html($(result).find('.tabs__item-content-box').html());
console.log("Отправлено");
}
});
})
})


};
getFilter()

<?
// перед компонентом
if (isset($_POST['_ajax']) && $_POST['_ajax'] == 'Y') {
    if (isset($_POST["filialId"]) && $_POST["filialId"]) {
        $GLOBALS['arFilterNews']["PROPERTY_FILIALY"] = (int)$_POST["filialId"];
    } else {
        $GLOBALS['arFilterNews']["PROPERTY_FILIALY"] = [];
    }

    $GLOBALS['APPLICATION']->RestartBuffer();
}
?>