|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ================================================================Плагины=============================================================================== -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

RARA Demo Import ---- загрузка демонстрационных файлов темы
Custom Post Type UI ---- создание разделов в админке
редирект ---- дополнение к форме (редирект)
Contact Form 7 ---- форма обратной связи
Show IDs by DraftPress ---- добавляет колонку id
YoastSEO ---- сео оптимизация и хлебные крошки
CMS Tree Page View ---- Добавляет древовидный список записей
Cyr----To----Lat ---- Преобразует не----латинские символы в ярлыках записей, страниц и рубрик в латинские.
Duplicate Page ---- Копирование страниц
Post Views Counter ---- Счетчик просмотров
Breadcrumb NavXT ---- Хлебные крошки для shema.org
Akismet Anti----spam ---- Защита от спама
Autoptimize ---- Он может агрегировать, минимизировать и кэшировать скрипты и стили
ReCaptcha for Contact Form 7 ---- защищает вас от спама
JivoChat Live Chat ---- "Универсальный канал связи специально для электронной коммерции JivoChat – это универсальный бизнес----мессенджер"


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ==========================================================Вывод популярных меток========================================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

function wpb_tag_cloud()
{
$tags = get_tags();
$args = array(
'smallest' => 10,
'largest' => 22,
'unit' => 'px',
'number' => 10,
'format' => 'flat',
'separator' => " ",
'orderby' => 'count',
'order' => 'DESC',
'show_count' => 1,
'echo' => false
);

$tag_string = wp_generate_tag_cloud($tags, $args);

return $tag_string;
}
// Add a shortcode so that we can use it in widgets, posts, and pages
add_shortcode('wpb_popular_tags', 'wpb_tag_cloud');

// Enable shortcode execution in text widget
add_filter('widget_text', 'do_shortcode');


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ======================================================Вывод постов с пагинацией========================================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

<?php
$query = new WP_Query(
    [
        'post_type'      => 'post',
        'category_name' => 'blog',
        'paged' => get_query_var('paged') ?: 1 // страница пагинации

    ]
);
if (have_posts()) : while ($query->have_posts()) : $query->the_post(); ?>
        <!-- Вывод постов, функции цикла: the_title() и т.д. -->

        <!-- контент поста the_title(); -->

    <?php endwhile;
else : ?>
    Записей нет.
<?php endif; ?>
<!-- пагинация -->
<?php the_posts_pagination(); ?>


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Вывод счетчика просмотров для превью (Post Views Counter)========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

<?php
$url = get_the_permalink($post);
$post_ID = url_to_postid($url);
// echo "ID поста = ". $post_ID;

echo do_shortcode('[post-views id =' . $post_ID . ']'); ?>


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Простой фильтр========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

Функция фильтра
function getSpan($tags)
{
return "<span>{$tags}</span>";
}
Добавление фильтра
add_filter('foo', 'getSpan');
Активация фильтра
$result = apply_filters('foo', $tag_string);


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Создание шорткода========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

function название_функции()
{
<!-- тело функции -->

return "что-то";
}

// Добавляет шорткод
add_shortcode('псевдоним для шорткода', 'название_функции');

// Enable shortcode execution in text widget
add_filter('widget_text', 'do_shortcode');


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Фильтр========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||