|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ================================================================Плагины=============================================================================== -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

RARA Demo Import ---- загрузка демонстрационных файлов темы
Custom Post Type UI ---- создание разделов в админке
редирект ---- дополнение к форме (редирект)
Contact Form 7 ---- форма обратной связи
Show IDs by DraftPress ---- добавляет колонку id
YoastSEO ---- сео оптимизация и хлебные крошки
CMS Tree Page View ---- Добавляет древовидный список записей
Cyr----To----Lat ---- Преобразует не----латинские символы в ярлыках записей, страниц и рубрик в латинские.
Duplicate Page ---- Копирование страниц
Post Views Counter ---- Счетчик просмотров
Breadcrumb NavXT ---- Хлебные крошки для shema.org
Akismet Anti----spam ---- Защита от спама
Autoptimize ---- Он может агрегировать, минимизировать и кэшировать скрипты и стили
ReCaptcha for Contact Form 7 ---- защищает вас от спама
JivoChat Live Chat ---- "Универсальный канал связи специально для электронной коммерции JivoChat – это универсальный бизнес----мессенджер"


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ==========================================================Вывод популярных меток========================================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

function wpb_tag_cloud()
{
$tags = get_tags();
$args = array(
'smallest' => 10,
'largest' => 22,
'unit' => 'px',
'number' => 10,
'format' => 'flat',
'separator' => " ",
'orderby' => 'count',
'order' => 'DESC',
'show_count' => 1,
'echo' => false
);

$tag_string = wp_generate_tag_cloud($tags, $args);

return $tag_string;
}
// Add a shortcode so that we can use it in widgets, posts, and pages
add_shortcode('wpb_popular_tags', 'wpb_tag_cloud');

// Enable shortcode execution in text widget
add_filter('widget_text', 'do_shortcode');


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ======================================================Вывод постов с пагинацией========================================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

<?php
$query = new WP_Query(
    [
        'post_type'      => 'post',
        'category_name' => 'blog',
        'paged' => get_query_var('paged') ?: 1 // страница пагинации

    ]
);
if (have_posts()) : while ($query->have_posts()) : $query->the_post(); ?>
        <!-- Вывод постов, функции цикла: the_title() и т.д. -->

        <!-- контент поста the_title(); -->

    <?php endwhile;
else : ?>
    Записей нет.
<?php endif; ?>
<!-- пагинация -->
<?php the_posts_pagination(); ?>


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Вывод счетчика просмотров для превью (Post Views Counter)========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

<?php
$url = get_the_permalink($post);
$post_ID = url_to_postid($url);
// echo "ID поста = ". $post_ID;

echo do_shortcode('[post-views id =' . $post_ID . ']'); ?>


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Простой фильтр========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

Функция фильтра
function getSpan($tags)
{
return "<span>{$tags}</span>";
}
Добавление фильтра
add_filter('foo', 'getSpan');
Активация фильтра
$result = apply_filters('foo', $tag_string);


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Создание шорткода========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

function название_функции()
{
<!-- тело функции -->

return "что-то";
}

// Добавляет шорткод
add_shortcode('псевдоним для шорткода', 'название_функции');

// Enable shortcode execution in text widget
add_filter('widget_text', 'do_shortcode');


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Создание шорткода c параметрами========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

// ==================== шорткоды============================
function them_banner($atts)
{
	$atts = shortcode_atts( array(
		'id' => '',
	), $atts );

// параметры по умолчанию
$my_posts = get_posts( array(
	'include'     => $atts["id"],
	'post_type'   => 'katalog',
) );


return $my_posts[0]->post_content;

}

// Добавляет шорткод
add_shortcode('banner', 'them_banner');

// Enable shortcode execution in text widget
// add_filter('widget_text', 'do_shortcode');

|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ====================================Фильтр========================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||


|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ==========================================================Создание полей через кастомайзер========================================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

function имя_функции($wp_customize) {
	
	//секция
	$wp_customize->add_section('имя_секции' , array(
	  'title'    => 'Телефон',
	  'priority' => 99,
	));

	//Поле
	$wp_customize->add_setting('имя_поля', array(
	  'capability' => 'edit_theme_options',
	  'default' => '',
	  'sanitize_callback' => 'sanitize_text_field', /*тип поля()*/
	));

	// настройки поля
	$wp_customize->add_control('имя_поля', array(
	  'type' => 'input',                            /*тип поля()*/
	  'section' => 'имя_секции',
	  'label' => 'Телефон',
	));
}

<!-- [для изображений] -->

$wp_customize->add_control(new WP_Customize_Image_Control($wp_customize, 'имя_поля', array(
			'settings' => 'имя_поля',
			'section' => 'имя_секции',
			'label' => 'Иконка',
		  )));
<!-- [/для изображений] -->

add_action('customize_register', 'имя_функции');

<!-- для вывода в шаблоне -->
<? echo get_theme_mod('имя_поля');?>

<!-- типы данных -->
sanitize_text_field / input
sp_sanitize_number / Number
sp_sanitize_checkbox / checkbox
sanitize_textarea_field / textarea
esc_url_raw / 'settings' => 'test_img', / 'type' => 'image',
<!-- ======================================================= -->
Для строки - sanitize_text_field;
Для числа - sp_sanitize_number;
Для текста - sp_sanitize_textarea;
Для чекбокса - sp_sanitize_checkbox;
Для изображения - esc_url_raw;

Для вывода значений настройки используется функция get_theme_mod().

Пример:

echo get_theme_mod('test_str');

|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||
<!-------- ==========================================================Создание виджетов========================================================================= -------->
|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

<!-- регистрация нового поля -->
function remont_custom_widgets_init() {
	register_sidebar(
		array(
			'name'          => esc_html__( 'Footer' ),
			'id'            => 'Footer',
			'description'   => esc_html__( 'Add widgets here.', 'remont' ),
			'before_widget' => '<section id="%1$s" class="widget %2$s">',
			'after_widget'  => '</section>',
			'before_title'  => '<h2 class="widget-title">',
			'after_title'   => '</h2>',
		)
	);
}
add_action( 'widgets_init', 'remont_custom_widgets_init' );

<!-- вывод в нужном месте -->
<?php dynamic_sidebar( 'Footer' ); ?>